Conf.Simple/src/InformationRegisters/SUI_ШтрихкодыУпаковокДокументовОбмена/SUI_ШтрихкодыУпаковокДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ШтрихкодыУпаковокДокументовОбмена</name>
  <resources>
    <name>id_barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>additional_details</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>hash</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_tbl_marking_codes/SUI_tbl_marking_codes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_tbl_marking_codes</name>
  <resources>
    <name>id_good</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_property</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_series</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_unit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>mark_code</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_ШтрихкодыУпаковокДокументовОбмена/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьТаблицуЭталон() Экспорт
	
	Таблица = Новый ТаблицаЗначений();
	
	Для Каждого Колонка Из SUI_ДокументыОбменаПовтИсп.КолонкиТаблицыШтрихкодыУпаковокДокументовОбмена() Цикл
		Таблица.Колонки.Добавить(Колонка.Имя, Колонка.Тип, Колонка.Заголовок);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Процедура ЗагрузитьОтсканированныеШтрихкоды(ИдентификаторДокументаОбмена, ЗагружаемаяТаблица) Экспорт
	
	Если ЗагружаемаяТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторДокументаОбмена", ИдентификаторДокументаОбмена);
	Запрос.УстановитьПараметр("ЗагружаемаяТаблица", ЗагружаемаяТаблица);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗагружаемаяТаблица.hash,
		|	ЗагружаемаяТаблица.barcode,
		|	ЗагружаемаяТаблица.id_barcode
		|ПОМЕСТИТЬ втЗагружаемаяТаблица
		|ИЗ
		|	&ЗагружаемаяТаблица КАК ЗагружаемаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ИдентификаторДокументаОбмена КАК sid_doc,
		|	втЗагружаемаяТаблица.hash,
		|	втЗагружаемаяТаблица.barcode,
		|	втЗагружаемаяТаблица.id_barcode,
		|	ЕСТЬNULL(ШтрихкодыУпаковок.additional_details, """") КАК additional_details,
		|	ЕСТЬNULL(ШтрихкодыУпаковок.ДатаЗаписи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗаписи
		|ИЗ
		|	втЗагружаемаяТаблица КАК втЗагружаемаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_ШтрихкодыУпаковокДокументовОбмена КАК ШтрихкодыУпаковок
		|		ПО ШтрихкодыУпаковок.sid_doc = &ИдентификаторДокументаОбмена
		|		И втЗагружаемаяТаблица.hash = ШтрихкодыУпаковок.hash";
	
	ЗаписатьШтрихкодыПоРезультатуЗапроса(Запрос.Выполнить());
	
КонецПроцедуры

Функция ПолучитьШтрихкодыУпаковок(Отбор = Неопределено, Первые = 0) Экспорт
	
	Запрос = СформироватьЗапросОтсканированныеШтрихкоды(Отбор, Первые);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ПодготовитьТаблицуВыгрузкиИзДокумента1С(РезультатЗапросаДанных, АлгоритмДопРеквизитов, РезультатВыборкиТЧ) Экспорт
	
	ТаблицаДанных = ПолучитьТаблицуЭталон();
	
	Если РезультатЗапросаДанных.Пустой() Тогда
		Возврат ТаблицаДанных;
	КонецЕсли;
	
	ТаблицаДанных.Колонки.Добавить("НомерСтроки", SUI_ОбщегоНазначения.ОписаниеТипаЧисло(6));
	ТаблицаДанных.Колонки.Добавить("ПредставлениеШтрихкода", ТаблицаДанных.Колонки["barcode"].ТипЗначения);
	
	Выборка = РезультатЗапросаДанных.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТаблицаДанных = ТаблицаДанных.Добавить();
		СтрокаТаблицаДанных.НомерСтроки = Выборка.НомерСтроки;
		СтрокаТаблицаДанных.id_barcode = SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(Выборка.id, Истина);
		СтрокаТаблицаДанных.ПредставлениеШтрихкода = Строка(Выборка.id);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДанных.id_barcode КАК id_barcode,
		|	ТаблицаДанных.НомерСтроки,
		|	ТаблицаДанных.ПредставлениеШтрихкода
		|ПОМЕСТИТЬ втТаблицаДанных
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	id_barcode
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТаблицаДанных.НомерСтроки,
		|	втТаблицаДанных.id_barcode,
		|	ЕСТЬNULL(ШтрихкодыУпаковок.mark_code, втТаблицаДанных.ПредставлениеШтрихкода) КАК barcode
		|ИЗ
		|	втТаблицаДанных КАК втТаблицаДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_marking_codes КАК ШтрихкодыУпаковок
		|		ПО втТаблицаДанных.id_barcode = ШтрихкодыУпаковок.id";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДанных = ПолучитьТаблицуЭталон();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ХешСтроки = SUI_Штрихкодирование.РасчитатьХешШтрихкода(Выборка.barcode);
		
		Если ПустаяСтрока(ХешСтроки) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицаДанных = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицаДанных, Выборка);
		СтрокаТаблицаДанных.hash = ХешСтроки;
		
		Если ЗначениеЗаполнено(АлгоритмДопРеквизитов) И РезультатВыборкиТЧ <> Неопределено Тогда
			
			ПараметрыАлгоритма = Неопределено;
			
			ОтборВВыборкеТЧ = Новый Структура();
			ОтборВВыборкеТЧ.Вставить("НомерСтроки", Выборка.НомерСтроки);
			
			РезультатВыборкиТЧ.Выборка.Сбросить();
			
			Если РезультатВыборкиТЧ.Выборка.НайтиСледующий(ОтборВВыборкеТЧ) Тогда
				
				ПараметрыАлгоритма = Новый Структура();
				ПараметрыАлгоритма.Вставить("ДанныеСтроки", Новый Структура(РезультатВыборкиТЧ.Колонки));
				
				ЗаполнитьЗначенияСвойств(ПараметрыАлгоритма.ДанныеСтроки, РезультатВыборкиТЧ.Выборка);
				
			КонецЕсли;
			
			// Дополнительные реквизиты Начало
			ПриемникДопРеквизитов = Новый Структура();
			SUI_ДополнительныеРеквизитыТаблиц.ДобавитьДополнительныеРеквизитыВПриемник(ПриемникДопРеквизитов, 
				АлгоритмДопРеквизитов, ПараметрыАлгоритма);
			// Дополнительные реквизиты Конец
			
			Если ПриемникДопРеквизитов.Свойство("additional_details") Тогда
				СтрокаТаблицаДанных.additional_details = ПриемникДопРеквизитов.additional_details;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаДанных;
	
КонецФункции

Функция ЗагрузитьТаблицуВыгрузкиИзДокумента1С(ИдентификаторДокументаОбмена, ЗагружаемаяТаблица) Экспорт
	
	Если ЗагружаемаяТаблица.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗагружаемаяТаблица", ЗагружаемаяТаблица);
	Запрос.УстановитьПараметр("ИдентификаторДокументаОбмена", ИдентификаторДокументаОбмена);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗагружаемаяТаблица.hash,
		|	ЗагружаемаяТаблица.id_barcode,
		|	ЗагружаемаяТаблица.barcode,
		|	ЗагружаемаяТаблица.additional_details
		|ПОМЕСТИТЬ втЗагружаемаяТаблица
		|ИЗ
		|	&ЗагружаемаяТаблица КАК ЗагружаемаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ИдентификаторДокументаОбмена КАК sid_doc,
		|	втЗагружаемаяТаблица.hash,
		|	втЗагружаемаяТаблица.barcode,
		|	втЗагружаемаяТаблица.id_barcode,
		|	втЗагружаемаяТаблица.additional_details КАК additional_details,
		|	ЕСТЬNULL(ШтрихкодыУпаковок.ДатаЗаписи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗаписи
		|ИЗ
		|	втЗагружаемаяТаблица КАК втЗагружаемаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_ШтрихкодыУпаковокДокументовОбмена КАК ШтрихкодыУпаковок
		|		ПО ШтрихкодыУпаковок.sid_doc = &ИдентификаторДокументаОбмена
		|		И втЗагружаемаяТаблица.hash = ШтрихкодыУпаковок.hash";
	
	ЗаписатьШтрихкодыПоРезультатуЗапроса(Запрос.Выполнить());
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьЗапросОтсканированныеШтрихкоды(Отбор = Неопределено, Первые = 0, ПоместитьВ = "", МенеджерВТ = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ШтрихкодыУпаковок.sid_doc,
		|	ШтрихкодыУпаковок.hash,
		|	ШтрихкодыУпаковок.barcode,
		|	ШтрихкодыУпаковок.id_barcode,
		|	ШтрихкодыУпаковок.additional_details,
		|	ШтрихкодыУпаковок.ДатаЗаписи,
		|	ШтрихкодыУпаковок.ДатаОбновления
		|ИЗ
		|	РегистрСведений.SUI_ШтрихкодыУпаковокДокументовОбмена КАК ШтрихкодыУпаковок";
	
	ПерезагрузитьТекстЗапроса = Ложь;
	
	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	
	ЗапросПакета = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1];
	ОператорыПакета = ЗапросПакета.Операторы[0];
	
	Если Первые > 0 Тогда
		
		ОператорыПакета.КоличествоПолучаемыхЗаписей = Первые;
		ПерезагрузитьТекстЗапроса = Истина;
		
	КонецЕсли;
	
	Если Отбор <> Неопределено Тогда
		
		ИмяФункцииВызова = "РегистрыСведений.SUI_ШтрихкодыУпаковокДокументовОбмена.СформироватьЗапросОтсканированныеШтрихкоды";
		
		ПроверяемыеТипыОтбора = Новый Массив();
		ПроверяемыеТипыОтбора.Добавить(Тип("Структура"));
		ПроверяемыеТипыОтбора.Добавить(Тип("ФиксированнаяСтруктура"));
		ПроверяемыеТипыОтбора.Добавить(Тип("Соответствие"));
		ПроверяемыеТипыОтбора.Добавить(Тип("ФиксированнаяСтруктура"));
		
		SUI_ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункцииВызова, "Отбор", Отбор, 
			Новый ОписаниеТипов(ПроверяемыеТипыОтбора));
		
		Для Каждого КлючЗначение Из Отбор Цикл
		
			ТипЗначения = ТипЗнч(КлючЗначение.Значение);
			КлючПараметра = СтрЗаменить(КлючЗначение.Ключ, ".", "_");
			
			Если ТипЗначения = Тип("Массив") Или 
				ТипЗначения = Тип("ФиксированныйМассив") Или
				ТипЗначения = Тип("СписокЗначений") Тогда
				
				ОператорыПакета.Отбор.Добавить(СтрШаблон("%1 В (&%2)", КлючЗначение.Ключ, КлючПараметра));
				
			Иначе
				ОператорыПакета.Отбор.Добавить(СтрШаблон("%1 = &%2", КлючЗначение.Ключ, КлючПараметра));
			КонецЕсли;
			
			Запрос.УстановитьПараметр(КлючПараметра, КлючЗначение.Значение);
			
			ПерезагрузитьТекстЗапроса = Истина;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(ПоместитьВ) Тогда
		
		Если МенеджерВТ = Неопределено Тогда
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
		Иначе
			Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		КонецЕсли;
		
		ЗапросПакета.ТаблицаДляПомещения = ПоместитьВ;
		ПерезагрузитьТекстЗапроса = Истина;
		
	КонецЕсли;
	
	Если ПерезагрузитьТекстЗапроса Тогда
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

Процедура ЗаписатьШтрихкодыПоРезультатуЗапроса(РезультатЗапроса)
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_ШтрихкодыУпаковокДокументовОбмена");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid_doc", "sid_doc");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("hash", "hash");
		Блокировка.Заблокировать();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Запись = СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
			Если ЗначениеЗаполнено(Запись.ДатаЗаписи) Тогда
				Запись.ДатаОбновления = ТекущаяДатаСеанса();
			Иначе
				Запись.ДатаЗаписи = ТекущаяДатаСеанса();
			КонецЕсли;
			
			Запись.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		Ошибка = ИнформацияОбОшибке();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ШтрихкодыУпаковокКлиентСервер.ИмяСобытия(), , , , Ошибка);
		ТекстОшибки = НСтр("ru = 'Не удалось записать штрихкоды упаковок документа обмена!'");
		ВызватьИсключение(ТекстОшибки, , , , Ошибка);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
